#include <stdio.h>

typedef struct{
    int number;     // 번호
    char name[11];  // 이름
    char phone[12]; // 전화번호
    int age;        // 나이
} Employee;         // typedef 선언

Employee list[10] = { // 직원 리스트
    { 1 , "손흥민1" , "01000000000" , 16 },
    { 2 , "손흥민2" , "01000000001" , 18 },
    { 3 , "손흥민3" , "01000000002" , 20 },
    { 4 , "손흥민4" , "01000000003" , 22 },
    { 5 , "손흥민5" , "01000000004" , 24 },
    { 6 , "손흥민6" , "01000000005" , 26 },
    { 7 , "손흥민7" , "01000000006" , 28 },
    { 8 , "손흥민8" , "01000000007" , 30 },
    { 9 , "손흥민9" , "01000000008" , 32 },
    { 0 , "손흥민0" , "01000000009" , 34 }
};

int main(void){

    // 사원수 만큼 반복한다.
    for(int i=0; i<sizeof(list)/10; i++){

        Employee e = list[i]; // e 변수에 구조체를 순서대로 저장한다.

        // 나이에 따라서 출력 여부를 결정한다.
        if( e.age >= 20 && e.age <=30 ){
            printf("이름=%s 나이=%d\n", e.name, e.age);
        }
    }

    return 0;
}